In [23]:
people = {
    'first' : ['Riya', 'Corey', 'Jane'],
    'last' : ['Gupta', 'Doe', 'Doe'],
    'email' : ['riya.gupta@gmail.com', 'corey.doe@gmail.com', 'jane.doe@gmail.com']
}

In [24]:
import pandas as pd

In [25]:
df = pd.DataFrame(people)

In [26]:
df.head()

   first   last                 email
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey    Doe   corey.doe@gmail.com
2   Jane    Doe    jane.doe@gmail.com

In [27]:
df['fullname'] = df['first'] + ' ' + df['last']
df

   first   last                 email    fullname
0   Riya  Gupta  riya.gupta@gmail.com  Riya Gupta
1  Corey    Doe   corey.doe@gmail.com   Corey Doe
2   Jane    Doe    jane.doe@gmail.com    Jane Doe

In [28]:
#To remove columns, use drop
df.drop(columns = ['first', 'last'], inplace=True)
df

                  email    fullname
0  riya.gupta@gmail.com  Riya Gupta
1   corey.doe@gmail.com   Corey Doe
2    jane.doe@gmail.com    Jane Doe

In [29]:
df['fullname'].str.split(' ', expand=True)

       0      1
0   Riya  Gupta
1  Corey    Doe
2   Jane    Doe

In [30]:
df[['first', 'last']] = df['fullname'].str.split(' ', expand=True)
df

                  email    fullname  first   last
0  riya.gupta@gmail.com  Riya Gupta   Riya  Gupta
1   corey.doe@gmail.com   Corey Doe  Corey    Doe
2    jane.doe@gmail.com    Jane Doe   Jane    Doe

In [31]:
df.append({'first' : 'Tony'}, ignore_index=True)

                  email    fullname  first   last
0  riya.gupta@gmail.com  Riya Gupta   Riya  Gupta
1   corey.doe@gmail.com   Corey Doe  Corey    Doe
2    jane.doe@gmail.com    Jane Doe   Jane    Doe
3                   NaN         NaN   Tony    NaN

In [32]:
people = {
    'first' : ['Tony', 'Goel'],
    'last' : ['Rishi', 'Doe'],
    'email' : ['tony.goel@gmail.com', 'rishi.doe@gmail.com']
}

In [33]:
df2 = pd.DataFrame(people)

In [34]:
df2.head()

  first   last                email
0  Tony  Rishi  tony.goel@gmail.com
1  Goel    Doe  rishi.doe@gmail.com

In [35]:
#Join two dataframes
df = df.append(df2, ignore_index=True)
df

                  email    fullname  first   last
0  riya.gupta@gmail.com  Riya Gupta   Riya  Gupta
1   corey.doe@gmail.com   Corey Doe  Corey    Doe
2    jane.doe@gmail.com    Jane Doe   Jane    Doe
3   tony.goel@gmail.com         NaN   Tony  Rishi
4   rishi.doe@gmail.com         NaN   Goel    Doe

In [36]:
df.drop(index=4)

                  email    fullname  first   last
0  riya.gupta@gmail.com  Riya Gupta   Riya  Gupta
1   corey.doe@gmail.com   Corey Doe  Corey    Doe
2    jane.doe@gmail.com    Jane Doe   Jane    Doe
3   tony.goel@gmail.com         NaN   Tony  Rishi

In [37]:
df.drop(index=df[df['last'] == 'Doe'].index)

                  email    fullname first   last
0  riya.gupta@gmail.com  Riya Gupta  Riya  Gupta
3   tony.goel@gmail.com         NaN  Tony  Rishi